minesweeper_backend/app/controllers/games_controller.rb

    def create
      @game = Game.create(
        user_id: params["user_id"],
        score: params["score"],
        difficulty: params["difficulty"]
        )
---
INSERT INTO "games" ("difficulty", "score", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["difficulty", "beginner"], ["score", 0], ["user_id", 12], ["created_at", "2019-05-08 16:21:26.965431"], ["updated_at", "2019-05-08 16:21:26.965431"]]