minesweeper_backend/app/controllers/games_controller.rb

  def index
    @games = Game.all.order(difficulty: :asc)
---
SELECT "games".* FROM "games" ORDER BY "games"."difficulty" ASC