minesweeper_backend/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "created_at", "updated_at") VALUES (?, ?, ?)  [["username", "ckauree"], ["created_at", "2019-05-08 00:27:40.086021"], ["updated_at", "2019-05-08 00:27:40.086021"]]
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "ckauree"], ["LIMIT", 1]]
---
  def create
    @user = User.find_or_create_by(username: params["username"])